# Operations

There are lots of operations with pandas that will be really useful to you, but don't fall into any distinct category. Let's show them here in this lecture:

In [2]:
import pandas as pd
df = pd.DataFrame({'col1':[1,2,3,4],'col2':[444,555,666,444],'col3':['abc','def','ghi','xyz']})
df.head()

   col1  col2 col3
0     1   444  abc
1     2   555  def
2     3   666  ghi
3     4   444  xyz

>__df.unique()__ : check the unique values for a column

In [4]:
df['col2'].unique()

array([444, 555, 666], dtype=int64)

>__df['columnname'].nunique()__ : see the number of unique values

In [6]:
df['col2'].nunique()

3

>__df['columnname'].value_counts()__ : count the number of unique values

In [7]:
df['col2'].value_counts()

444    2
555    1
666    1
Name: col2, dtype: int64

In [8]:
df['col2'].unique()

array([444, 555, 666], dtype=int64)

In [10]:
def times2(x):
    return x*2

In [11]:
df['col1'].sum()

10

>__df['columnname'].apply({name of function})__ : apply a custom function to pd instances

In [12]:
df['col1'].apply(times2)

0    2
1    4
2    6
3    8
Name: col1, dtype: int64

In [13]:
df['col2'].apply(lambda x:x*2)

0     888
1    1110
2    1332
3     888
Name: col2, dtype: int64

>__df.drop('column', axis=1,inplace=True)__ : delete a column

>__df.columns__ : return the list of column names

In [14]:
df.columns

Index(['col1', 'col2', 'col3'], dtype='object')

>__df.index__ : see the number of data

In [15]:
df.index

RangeIndex(start=0, stop=4, step=1)

>__df.sort_values('column')__ : sort the column according to the column

In [17]:
df.sort_values(by='col2')

   col1  col2 col3
0     1   444  abc
3     4   444  xyz
1     2   555  def
2     3   666  ghi

In [18]:
df.sort_values(by='col2', ascending=False)

   col1  col2 col3
2     3   666  ghi
1     2   555  def
0     1   444  abc
3     4   444  xyz

>__df.isnull()__ : show whether a data is null or notj

In [19]:
df.isnull()

    col1   col2   col3
0  False  False  False
1  False  False  False
2  False  False  False
3  False  False  False

In [22]:
data = {'A':['foo','foo','foo','bar','bar','bar'],
     'B':['one','one','two','two','one','one'],
       'C':['x','y','x','y','x','y'],
       'D':[1,3,2,5,4,1]}

df = pd.DataFrame(data)

> __df.pivot_table(...)__ : create pivot tables

In [24]:
df.pivot_table(values='D',index=['A','B'], columns=['C'])

C          x    y
A   B
bar one  4.0  1.0
    two  NaN  5.0
foo one  1.0  3.0
    two  2.0  NaN

In [25]:
df.pivot_table(values='D',index=['A','B'])

           D
A   B
bar one  2.5
    two  5.0
foo one  2.0
    two  2.0